# Used Car Price Prediction Project 
##### By: Yordanos Simegnew

#### 1. Importing the necessary libraries

In [1]:
# importing necessary libraries
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from datetime import datetime
import warnings
warnings.filterwarnings("ignore")
pd.set_option("display.max_columns",None)

#### 2. Loading the Dataset

In [2]:
# Loading the dataset
df = pd.read_csv("C:\\Users\\yozil\\Desktop\\My projects\\used car price prediction\\used_car_price_prediction\\data\\raw\\car data.csv")
df

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

#### 3. First look at the Data

In [3]:
# displaying 4 sample records
df.sample(4)

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
216,eon,2016,2.90,4.43,12500,Petrol,Dealer,Manual,0
128,Honda CB Hornet 160R,2017,0.80,0.87,3000,Petrol,Individual,Manual,0
156,TVS Sport,2017,0.48,0.52,15000,Petrol,Individual,Manual,0
239,eon,2012,2.00,4.43,23709,Petrol,Dealer,Manual,0

In [4]:
# displaying the name of columns
df.columns

Index(['Car_Name', 'Year', 'Selling_Price', 'Present_Price', 'Kms_Driven',
       'Fuel_Type', 'Seller_Type', 'Transmission', 'Owner'],
      dtype='object')

In [5]:
# shape of the dataframe
df.shape

(301, 9)

In [6]:
# general information on the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       301 non-null    object
 1   Year           301 non-null    int64
 2   Selling_Price  301 non-null    float64
 3   Present_Price  301 non-null    float64
 4   Kms_Driven     301 non-null    int64
 5   Fuel_Type      301 non-null    object
 6   Seller_Type    301 non-null    object
 7   Transmission   301 non-null    object
 8   Owner          301 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 21.3+ KB

#### 4. Data Cleaning

##### 4.1 Standardizing column names

Here we perform two tasks
1. Standardizing the name of each column name such that it appears in the (title case format)
2. Adding units to columns that need units

In [7]:
# 1. standardizing text columns
df.columns = df.columns.str.title()

Adding units to columns that need units,
Here the columns that need units are 
1. Selling price and present price have to be both interms of ($)

In [8]:
df.rename(columns = {"Selling_Price":"Selling_Price($)", "Present_Price":"Present_Price($)"}, inplace = True)

In [9]:
df.sample(3)

,Car_Name,Year,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
149,Bajaj Pulsar 220 F,2016,0.51,0.94,24000,Petrol,Individual,Manual,0
205,grand i10,2016,5.25,5.70,3493,Petrol,Dealer,Manual,1
258,city,2015,8.40,13.60,25000,Petrol,Dealer,Manual,0

##### 4.2 Standardizing Text columns

In [10]:
# here we standardize all columns with text type of data to a title case format.
def text_maker(text):
    return text.str.title()

In [11]:
# displaying the text columns of 4 sample records
df.select_dtypes("object").sample(4)

          Car_Name Fuel_Type Seller_Type Transmission
72   corolla altis    Petrol      Dealer       Manual
67        fortuner    Diesel      Dealer       Manual
247          verna    Petrol      Dealer       Manual
80   corolla altis    Diesel      Dealer       Manual

In [12]:
# applying the text maker function specifically to the text columns and updating the original dataframe
df[df.select_dtypes("object").columns] = df.select_dtypes("object").apply(text_maker)

In [13]:
# overwritting the existing text columns with the new 
df[df.select_dtypes("object").columns] = df.select_dtypes("object").apply(text_maker)

In [14]:
# displaying sample records from our dataset
df.sample(3)

,Car_Name,Year,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
269,City,2015,6.70,10.00,18828,Petrol,Dealer,Manual,0
57,Corolla Altis,2010,4.75,18.54,50000,Petrol,Dealer,Manual,0
159,Honda Activa 4G,2017,0.45,0.51,4000,Petrol,Individual,Automatic,0

##### 4.3 Removing Unecessary Space from the text columns (if any)

In [15]:
# let's define a function to remove unecessary space form the text columns
def space_remover(text):
    return text.str.strip()

In [16]:
# now let's apply this function in our text columns and update our dataframe
df[df.select_dtypes("object").columns] = df.select_dtypes("object").apply(space_remover)

In [17]:
# displaying sample records from our dataset
df.sample(3)

,Car_Name,Year,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
94,Corolla Altis,2008,4.00,22.78,89000,Petrol,Dealer,Automatic,0
250,Creta,2016,12.90,13.60,35934,Diesel,Dealer,Manual,0
28,Alto K10,2010,1.95,3.95,44542,Petrol,Dealer,Manual,0

##### 4.4 Removing Duplicated Records(if any)

In [18]:
# let's check for the existance of any duplicated records
df.duplicated().any()

True

In [19]:
# the above result shows we have a duplicated records, let\s see how many duplicated records we have
df.duplicated().sum()

2

In [20]:
# as shown from the above result we have two duplicated records, let's see this duplicated records
df[df.duplicated()]

,Car_Name,Year,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
17,Ertiga,2016,7.75,10.79,43000,Diesel,Dealer,Manual,0
93,Fortuner,2015,23.00,30.61,40000,Diesel,Dealer,Automatic,0

In [21]:
# now let's remove this duplicated records, since they make our model to be biased.
df.drop_duplicates(inplace = True)

In [22]:
df.shape

(299, 9)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 299 entries, 0 to 300
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Car_Name          299 non-null    object
 1   Year              299 non-null    int64
 2   Selling_Price($)  299 non-null    float64
 3   Present_Price($)  299 non-null    float64
 4   Kms_Driven        299 non-null    int64
 5   Fuel_Type         299 non-null    object
 6   Seller_Type       299 non-null    object
 7   Transmission      299 non-null    object
 8   Owner             299 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 23.4+ KB

In [24]:
# now let's fix our index column.
df.reset_index(inplace = True)

In [25]:
df.sample(3)

,index,Car_Name,Year,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
189,191,Bajaj Discover 125,2012,0.20,0.57,25000,Petrol,Individual,Manual,1
41,42,Sx4,2008,1.95,7.15,58000,Petrol,Dealer,Manual,0
44,45,Ciaz,2014,7.50,12.04,15000,Petrol,Dealer,Automatic,0

In [26]:
df.drop("index", axis = 1, inplace = True)

In [27]:
df.index

RangeIndex(start=0, stop=299, step=1)

In [28]:
df.sample(3)

,Car_Name,Year,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
48,Ciaz,2017,7.75,9.29,37000,Petrol,Dealer,Automatic,0
293,City,2015,8.55,13.09,60076,Diesel,Dealer,Manual,0
186,Hero Glamour,2013,0.25,0.57,18000,Petrol,Individual,Manual,0

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Car_Name          299 non-null    object
 1   Year              299 non-null    int64
 2   Selling_Price($)  299 non-null    float64
 3   Present_Price($)  299 non-null    float64
 4   Kms_Driven        299 non-null    int64
 5   Fuel_Type         299 non-null    object
 6   Seller_Type       299 non-null    object
 7   Transmission      299 non-null    object
 8   Owner             299 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 21.2+ KB

##### 4.5 Handling Missing Values (if any)

In [30]:
# from the above result of general information we can see that we don't have any missing value in any columns but we can check it here again
df.isnull().any()

Car_Name            False
Year                False
Selling_Price($)    False
Present_Price($)    False
Kms_Driven          False
Fuel_Type           False
Seller_Type         False
Transmission        False
Owner               False
dtype: bool

In [31]:
df.isnull().sum()

Car_Name            0
Year                0
Selling_Price($)    0
Present_Price($)    0
Kms_Driven          0
Fuel_Type           0
Seller_Type         0
Transmission        0
Owner               0
dtype: int64

In [32]:
# so we don't have any missing values in the dataset

##### 4.6 Extracting infromation from a column

In [33]:
# here we can extract the age of the car from the year column.

In [34]:
# displaying 3 sample records
df.sample(3)

,Car_Name,Year,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
67,Corolla Altis,2011,4.35,13.74,88000,Petrol,Dealer,Manual,0
103,Ktm Rc390,2015,1.35,2.37,21700,Petrol,Individual,Manual,0
255,City,2015,8.50,13.60,40324,Petrol,Dealer,Manual,0

In [35]:
# first let's see the exact time of today
today  = datetime.today()
today

datetime.datetime(2024, 6, 8, 9, 36, 39, 744629)

In [36]:
# now let's extract the year from the todays date
year = today.year
year

2024

In [37]:
# now let's extract the year column from our today year to get the age of each car
df.insert(df.columns.get_loc("Year")+1,"Age",(year - df.Year))

In [38]:
df.sample(3)

,Car_Name,Year,Age,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
45,Ritz,2013,11,2.65,4.89,64532,Petrol,Dealer,Manual,0
216,Verna,2014,10,6.45,9.40,45078,Petrol,Dealer,Manual,0
245,Verna,2015,9,5.95,9.40,36000,Petrol,Dealer,Manual,0

##### 4.7 Handling an outliers

In [39]:
# for the case of this project we consider all results out of 4 standard deviation from the mean as an outliers.
# now let's define a function that can show us the outlier limits for each numerical columns.
def outlier_limit(col):
    mean = col.mean()
    std = col.std()
    upper_limit = mean +  4 * std
    lower_limit = mean -  4 * std
    return upper_limit, lower_limit

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Car_Name          299 non-null    object
 1   Year              299 non-null    int64
 2   Age               299 non-null    int64
 3   Selling_Price($)  299 non-null    float64
 4   Present_Price($)  299 non-null    float64
 5   Kms_Driven        299 non-null    int64
 6   Fuel_Type         299 non-null    object
 7   Seller_Type       299 non-null    object
 8   Transmission      299 non-null    object
 9   Owner             299 non-null    int64
dtypes: float64(2), int64(4), object(4)
memory usage: 23.5+ KB

In [41]:
outlier_limit(df.select_dtypes(["int64","float64"]))

(Year                  2025.202856
 Age                     21.972087
 Selling_Price($)        24.526591
 Present_Price($)        41.812584
 Kms_Driven          192977.433918
 Owner                    1.038359
 dtype: float64,
 Year                  2002.027913
 Age                     -1.202856
 Selling_Price($)       -15.347327
 Present_Price($)       -26.730510
 Kms_Driven         -119143.928901
 Owner                   -0.951402
 dtype: float64)

In [42]:
df.select_dtypes(["int64","float64"]).apply(outlier_limit)

,Year,Age,Selling_Price($),Present_Price($),Kms_Driven,Owner
0,2025.202856,21.972087,24.526591,41.812584,192977.433918,1.038359
1,2002.027913,-1.202856,-15.347327,-26.730510,-119143.928901,-0.951402

In [43]:
# now let's see the records which violate our ouliter limits
def outliers(dff):
    outliers_df = pd.DataFrame()
    for col in dff.columns:
        mean = df[col].mean()
        std = df[col].std()
        upper_limit = mean + 4 * std
        lower_limit = mean - 4 * std
        outlier_data = dff[(df[col] > upper_limit) | (df[col] < lower_limit)]
        outliers_df = pd.concat([outliers_df,outlier_data]).drop_duplicates()
    return outliers_df

In [44]:
# let's see the number of  outlier records
outliers(df.select_dtypes(["int64","float64"])).shape[1]

6

In [45]:
# as we can see from the above result we have 6 outlier records, now let's see this records specifically
outliers(df.select_dtypes(["int64","float64"]))

     Year  Age  Selling_Price($)  Present_Price($)  Kms_Driven  Owner
63   2017    7             33.00             36.23        6000      0
85   2010   14             35.00             92.60       78000      0
83   2005   19              3.49             13.46      197176      0
177  2010   14              0.31              1.05      213000      0
194  2008   16              0.17              0.52      500000      0
84   2006   18              2.50             23.73      142000      3

In [46]:
# for the case of this project we handle outliers by just removing the records, so let's remove this records
outliers_index = outliers(df.select_dtypes(["int64","float64"])).index
outliers_index

Index([63, 85, 83, 177, 194, 84], dtype='int64')

In [47]:
# now we have to drop this index numbers from our original dataframe.
df.drop(outliers_index, inplace = True)
df

,Car_Name,Year,Age,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,Ritz,2014,10,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,Sx4,2013,11,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,Ciaz,2017,7,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,Wagon R,2011,13,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,Swift,2014,10,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...,...
294,City,2016,8,9.50,11.60,33988,Diesel,Dealer,Manual,0
295,Brio,2015,9,4.00,5.90,60000,Petrol,Dealer,Manual,0
296,City,2009,15,3.35,11.00,87934,Petrol,Dealer,Manual,0
297,City,2017,7,11.50,12.50,9000,Diesel,Dealer,Manual,0
298,Brio,2016,8,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [48]:
df.shape

(293, 10)

In [49]:
df.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       289, 290, 291, 292, 293, 294, 295, 296, 297, 298],
      dtype='int64', length=293)

In [50]:
# now let's fix the index of the dataframe
df.reset_index(inplace = True)

In [51]:
df.sample(3)

,index,Car_Name,Year,Age,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
238,244,I20,2012,12,3.75,6.79,35000,Petrol,Dealer,Manual,0
201,207,Grand I10,2015,9,4.85,5.70,21125,Diesel,Dealer,Manual,0
87,91,Innova,2005,19,3.51,13.70,75000,Petrol,Dealer,Manual,0

In [52]:
df.drop("index",axis = 1, inplace = True)

In [53]:
df.sample(3)

,Car_Name,Year,Age,Selling_Price($),Present_Price($),Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
245,City,2014,10,7.2,9.9,48000,Diesel,Dealer,Manual,0
240,I10,2013,11,4.0,4.6,30000,Petrol,Dealer,Manual,0
211,Verna,2012,12,4.5,9.4,36000,Petrol,Dealer,Manual,0

In [54]:
### now we are done with the data cleaning process.

In [55]:
### Now let's export our cleaned dataframe
df.to_csv("C:\\Users\\yozil\\Desktop\\My projects\\used car price prediction\\used_car_price_prediction\\data\\processed\\cleaned_car_data.csv", index = False)